engenharia-software.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2025-05-14 qua 20:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Engenharia de software</title>
<meta name="author" content="Jackson de Jesus" />
<meta name="description" content="Resumo dos conceitos de engenharia de software" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Engenharia de software</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Capítulos</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8bc42a5">Capítulo 1</a>
<ul>
<li><a href="#org10b69c2">Fundamentos e modelos de processos prescritivos</a></li>
</ul>
</li>
<li><a href="#org4ee0d8d">Capítulo 2</a>
<ul>
<li><a href="#org45dba94">Principais métodos ágeis</a></li>
</ul>
</li>
<li><a href="#org07b411c">Capítulo 3</a>
<ul>
<li><a href="#orgfd3e432">Projeto de arquitetura de software, requisitos e gerenciamento de configuração</a></li>
</ul>
</li>
<li><a href="#orgb60212d">Capítulo 4</a>
<ul>
<li><a href="#org226d25c">Estimativas de esforço e custo para desenvolvimento de softwares</a></li>
</ul>
</li>
<li><a href="#orga6bba67">Capítulo 5</a>
<ul>
<li><a href="#org0693ecd">Teste de software e suas técnicas</a></li>
</ul>
</li>
<li><a href="#org93d4fd4">Capítulo 6</a>
<ul>
<li><a href="#org1177a03">Fundamentos e recursos da cultura DevOps</a></li>
</ul>
</li>
<li><a href="#org55146f8">Observações&#x2026;</a>
<ul>
<li><a href="#orgf703c25">Como organizei o conteúdo desta página</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb80a374">Voltar para o início&#x2026;</a></div>
</div>
<div id="outline-container-org8bc42a5" class="outline-3">
<h3 id="org8bc42a5">Capítulo 1</h3>
<div class="outline-text-3" id="text-org8bc42a5">
</div>
<div id="outline-container-org10b69c2" class="outline-4">
<h4 id="org10b69c2">Fundamentos e modelos de processos prescritivos</h4>
<div class="outline-text-4" id="text-org10b69c2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Engenharia de Software</b></b></td>
<td class="org-left">Aborda a necessidade da área em razão da complexidade e diversidade de padrões para o desenvolvimento de softwares.</td>
</tr>

<tr>
<td class="org-left"><b><b>Processos de software</b></b></td>
<td class="org-left">Um conjunto de elementos e atividades próprias de um processo de desenvolvimento de software, como atividades metodológicas, ações de engenharia de software, tarefas, produtos de trabalho, garantia de qualidade e mecanismos de controle de mudanças para cada projeto.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelos de processos prescritivos</b></b></td>
<td class="org-left">Modelos tradicionais que surgiram para organizar e direcionar atividades de desenvolvimento de software, com capacidade de prescrever um conjunto de elementos e atividades. Denominados "tradicionais" e criados com objetivos específicos para presumir o desenvolvimento de software.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelos de processos ágeis</b></b></td>
<td class="org-left">Modelos que representam uma abordagem contrária aos modelos prescritivos, com iterações curtas onde o resultado é medido pelo produto pronto. Serão estudados em detalhes futuramente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo em cascata</b></b></td>
<td class="org-left">Um dos principais modelos prescritivos, representa as atividades fundamentais do processo: especificação, desenvolvimento, validação e evolução. Precede uma atividade de revisão ao final de cada fase para avaliar se o projeto pode passar à fase seguinte.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do Modelo Cascata</b></b></td>
<td class="org-left">Incluem: Definição dos requisitos (serviços, restrições e metas são estabelecidos e definidos em detalhes); Projeto do sistema e do software (requisitos são repartidos entre hardware e software); Implementação e teste de unidade (projeto é realizado como um conjunto de programas ou unidades de programa que são implementadas e testadas); Integração e teste do sistema (unidades de programa são integradas e testadas como um sistema completo); Operação e manutenção (sistema é instalado, colocado em uso e aperfeiçoado à medida que novos requisitos são descobertos).</td>
</tr>

<tr>
<td class="org-left"><b><b>Desenvolvimento incremental</b></b></td>
<td class="org-left">Um dos principais modelos prescritivos, intercala as atividades de especificação, desenvolvimento e validação. O sistema é desenvolvido como uma série de versões (incrementos), cada uma acrescentando funcionalidades à versão anterior. A primeira versão pode ter funcionalidades limitadas, e versões posteriores adicionam mudanças.</td>
</tr>

<tr>
<td class="org-left"><b><b>Integração e configuração</b></b></td>
<td class="org-left">Um dos principais modelos prescritivos, baseia-se na disponibilidade de componentes ou sistemas reutilizáveis, focando na configuração desses componentes para um novo contexto e sua integração em um sistema.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Espiral</b></b></td>
<td class="org-left">Tem como característica principal a realização de ciclos de prototipação para a redução de riscos de projeto. É fortemente orientado a riscos, proposto por Boehm em 1986, apresentando a ideia em ciclos iterativos. Combina prevenção e tolerância a mudanças, assumindo que mudanças são resultado de riscos e incluindo atividades explícitas de gerenciamento de riscos para sua redução.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo Sashimi</b></b></td>
<td class="org-left">Introduz a noção de que as fases do modelo cascata não são estanques, podendo um projeto estar simultaneamente em mais de uma fase.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelos V e W</b></b></td>
<td class="org-left">Focam no teste durante o desenvolvimento de software, indicando que o teste deve ser uma preocupação constante desde o início, não apenas uma etapa final.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo orientado a cronograma</b></b></td>
<td class="org-left">Tem foco prioritário no desenvolvimento das funcionalidades mais importantes, deixando as demais para o final para garantir que as críticas sejam entregues no prazo em caso de atrasos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Entrega em estágios</b></b></td>
<td class="org-left">Tem como prioridade planejar e entregar partes prontas do sistema antes do final do projeto.</td>
</tr>

<tr>
<td class="org-left"><b><b>Prototipação evolucionária</b></b></td>
<td class="org-left">Propõe o uso de protótipos para ajudar na definição dos requisitos e na exploração de soluções de projeto. Permite que todo o sistema, ou parte dele, seja construído rapidamente para entender ou esclarecer dúvidas. O protótipo evolui até se tornar um sistema que pode ser entregue.</td>
</tr>

<tr>
<td class="org-left"><b><b>Métodos para prototipação</b></b></td>
<td class="org-left">Incluem: <b><b>Throw-away</b></b> (protótipos descartáveis, usados apenas para estudar aspectos do sistema, entender requisitos e reduzir riscos); e <b><b>Cornerstone</b></b> (protótipos fundamentais, usados para compreender todos os aspectos do throw-away e que se tornam parte do sistema final, evoluindo até se tornar o sistema entregue).</td>
</tr>

<tr>
<td class="org-left"><b><b>Rational Unified Process (RUP)</b></b></td>
<td class="org-left">Um modelo híbrido de processo, contrário a metodologias que oferecem uma visão única do processo. Aborda quatro fases no processo de software. Reúne elementos de outros modelos, apoiando prototipação e entrega incremental. Cada fase pode seguir o modo iterativo, com resultados incrementais, e as quatro fases juntas podem ser aplicadas incrementalmente ou seguir a metodologia espiral.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do RUP</b></b></td>
<td class="org-left">Incluem: <b><b>Concepção</b></b> (elaboração de plano de negócios, identificação de entidades externas e requisitos, avaliação da contribuição do sistema para o negócio); <b><b>Elaboração</b></b> (desenvolvimento dos requisitos e da arquitetura do sistema); <b><b>Construção</b></b> (implementação e testes do sistema); <b><b>Transição</b></b> (implantação do sistema em ambiente real).</td>
</tr>

<tr>
<td class="org-left"><b><b>Disciplinas do RUP</b></b></td>
<td class="org-left">O modelo apresenta um conjunto de seis atividades lógicas de projeto (Modelagem de negócios, Requisitos, Análise e design, Implementação, Teste, Implantação) e três de apoio (Ambiente, Gerenciamento de mudança e configuração, Gerência de projeto) para cada fase.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
