engenharia-software.org
*** Principais métodos ágeis

| Conceito | Descrição |
|---|---|
| **Métodos ágeis de desenvolvimento de software** | Surgiram em um esforço para sanar fraquezas da engenharia de software convencional, especialmente a sobrecarga dos modelos prescritivos em sistemas menores. |
| **Desenvolvimento ágil** | Abordagem de desenvolvimento de software que busca sanar fraquezas da engenharia convencional. |
| **Manifesto Ágil** | Documento que define a filosofia ágil, valorizando indivíduos e interações, software em funcionamento, colaboração com o cliente e resposta a mudanças, mais que processos e ferramentas, documentação abrangente, negociação de contratos e seguir um plano. |
| **Agilidade** | Mais que uma resposta à mudança, abrange a filosofia do manifesto ágil. Incentiva comunicação fácil em equipe, entrega rápida de software operacional, cliente como parte da equipe e planos flexíveis. Pode ser aplicada a qualquer projeto, sendo essencial que a equipe possa adaptar tarefas, planejar compreendendo a fluidez, eliminar artefatos não essenciais e enfatizar entrega incremental. |
| **Princípios do Manifesto Ágil** | Doze princípios que definem o espírito ágil, incluindo priorizar satisfação do cliente, aceitar mudanças, entregar software frequentemente, colaborar com cliente, confiar em indivíduos motivados, comunicação face a face, software em funcionamento como medida de progresso, desenvolvimento sustentável, excelência técnica, simplicidade, equipes auto-organizadas e autoavaliação regular. |
| **Método XP (Extreme Programming)** | Um método ágil que requer seguir uma série de práticas relacionadas ao cliente, gerência, programação e testes. |
| **Práticas do Método XP** | Incluem: Jogo de planejamento (equipe e cliente priorizam funcionalidades semanalmente); Programação em pares (dois programadores na mesma máquina, um usando a máquina e outro auxiliando); Padrões de codificação (equipe segue padrões para o código parecer ter sido desenvolvido pela mesma pessoa); Testes de aceitação (planejados e conduzidos com o cliente para verificar requisitos); Desenvolvimento orientado a teste (definir e implementar testes antes de programar a unidade); Refatoração (não fugir da refatoração para manter complexidade gerenciável); Integração contínua (integrar funcionalidade assim que viável para evitar surpresas). |
| **Método FDD (Feature Driven-Development)** | Método ágil que enfatiza orientação a objetos, apresentado em 1997. Dividido em duas fases. |
| **Fases do Método FDD** | Incluem: **Concepção e planejamento** (pensar antes de construir, em geral de uma a duas semanas); **Construção** (desenvolvimento iterativo do produto em ciclos de uma a duas semanas). |
| **Disciplinas do Método FDD** | Na fase de Concepção e planejamento: Desenvolver Modelo Abrangente (uso de modelagem orientada a objetos); Construir Lista de Funcionalidades (decomposição funcional para identificar funcionalidades); Planejar por Funcionalidade (planejamento de ciclos iterativos baseado em funcionalidades). Na fase de Construção: Detalhar por Funcionalidade (design orientado a objetos); Construir por Funcionalidade (construir e testar software usando linguagem e técnica orientadas a objetos). |
| **Método DSDM (Dynamic Systems Development Method)** | Modelo ágil baseado em desenvolvimento iterativo e incremental com participação ativa do usuário. Composto por três fases. |
| **Fases do Método DSDM** | Incluem: **Pré-projeto** (projeto é identificado, negociado, orçamento definido, contrato assinado); **Ciclo de vida** (inicia com análise de viabilidade e negócio, depois entra em ciclos iterativos de desenvolvimento); **Pós-projeto** (período considerado de manutenção). A fase de Ciclo de Vida se concentra nas atividades de Exploração, Engenharia e Desenvolvimento em ciclos iterativos. |
| **Princípios da filosofia DSDM** | Incluem: Envolvimento do usuário o tempo todo; Autonomia dos desenvolvedores para tomar decisões; Entregas frequentes de releases suficientemente boas; Eficácia das entregas na solução de problemas de negócio; Feedback dos usuários realimentando o processo; Reversibilidade de todas as ações; Previsibilidade do escopo e objetivos das iterações; Ausência de testes no escopo (considera teste fora do ciclo de vida). |
| **Método Crystal Clear** | Método ágil criado por Alistair Cockburn em 1997, adequado para equipes pequenas (até 8 pessoas) que trabalham juntas. Propõe o uso de radiadores de informação, acesso fácil a especialistas, eliminação de distrações, cronograma e ajuste do método. |
| **Ciclo de vida do Crystal Clear** | Organizado em três níveis: Iteração (estimação, desenvolvimento, celebração, dura poucas semanas); Entrega (várias iterações, entrega funcionalidades úteis em no máximo dois meses); Projeto (conjunto de todas as entregas). |
| **Pilares do Crystal Clear** | Incluem: Entrega frequente de software utilizável; Melhoria reflexiva (equipe reflete regularmente sobre seu processo); Comunicação osmótica (equipe na mesma sala ou contíguas para ouvir conversas relevantes); Segurança pessoal (desenvolvedores podem falar sem medo); Foco (membros da equipe têm tópicos de alta prioridade para trabalhar tranquilamente); Cooperação; Ambiente técnico com integração frequente e testes automatizados. |
| **Método ASD (Adaptive Software Development)** | Modelo ágil baseado em desenvolvimento cíclico iterativo. Fundamenta-se em três grandes fases. |
| **Fases do Modelo ASD** | Incluem: **Especular** (início do projeto, planejamento de ciclos adaptáveis, definindo duração, ciclos, objetivos, componentes, tecnologias e tarefas); **Colaborar** (foco no desenvolvimento dos componentes especificados); **Aprender** (revisão da qualidade, testes e manutenção). As três fases formam um ciclo iterativo. |
| **Método Scrum** | Modelo ágil para a gestão de projetos de software. Um dos conceitos mais importantes é o Sprint. Segue três fases na execução. |
| **Fases do Método Scrum** | Incluem: **Planejamento geral** (estabelece objetivos gerais do projeto e arquitetura); **Série de ciclos de Sprint** (cada ciclo desenvolve um incremento do sistema); **Encerramento do projeto** (completa documentação e avalia lições aprendidas). |
| **Papéis do Método Scrum** | Incluem: **Scrum Master** (responsável por manter o time em ambiente propício, facilitador e solucionador de conflitos); **Product Owner** (representa a voz do cliente, responsável pelo valor de negócio e necessidades dos clientes, indica requisitos mais importantes por sprint); **Scrum team** (responsável pelo desenvolvimento das entregas, entende requisitos, equipe de desenvolvimento geralmente com 6 a 10 pessoas). |
| **Product Backlog (Scrum)** | Lista das funcionalidades a serem implementadas em cada projeto, como os requisitos. Não precisa ser completo no início do projeto, podendo começar com as funcionalidades mais evidentes. |
| **Sprint (Scrum)** | Ciclo de desenvolvimento com poucas semanas de duração. No início de cada Sprint, a equipe prioriza elementos do Product Backlog para o Sprint Backlog. |
| **Sprint Backlog (Scrum)** | Lista de funcionalidades a serem implementadas no ciclo (Sprint) que se inicia. O Product Owner deve mantê-lo atualizado durante o Sprint. |
| **Reuniões no Scrum** | Incluem: **Reuniões diárias** (equipe se reúne diariamente para compartilhar o que fez ontem, o que fará hoje e quais impedimentos enfrenta); **Reunião de Revisão** (ao final de cada Sprint, para avaliar o que foi feito e receber feedback do Product Owner e stakeholders); **Reunião de Retrospectiva** (ao final de cada Sprint, para a equipe autoavaliar seu desempenho e identificar melhorias). |

