engenharia-software.html
<div id="outline-container-org4ee0d8d" class="outline-3">
<h3 id="org4ee0d8d">Capítulo 2</h3>
<div class="outline-text-3" id="text-org4ee0d8d">
</div>
<div id="outline-container-org45dba94" class="outline-4">
<h4 id="org45dba94">Principais métodos ágeis</h4>
<div class="outline-text-4" id="text-org45dba94">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Métodos ágeis de desenvolvimento de software</b></b></td>
<td class="org-left">Surgiram em um esforço para sanar fraquezas da engenharia de software convencional, especialmente a sobrecarga dos modelos prescritivos em sistemas menores.</td>
</tr>

<tr>
<td class="org-left"><b><b>Desenvolvimento ágil</b></b></td>
<td class="org-left">Abordagem de desenvolvimento de software que busca sanar fraquezas da engenharia convencional.</td>
</tr>

<tr>
<td class="org-left"><b><b>Manifesto Ágil</b></b></td>
<td class="org-left">Documento que define a filosofia ágil, valorizando indivíduos e interações, software em funcionamento, colaboração com o cliente e resposta a mudanças, mais que processos e ferramentas, documentação abrangente, negociação de contratos e seguir um plano.</td>
</tr>

<tr>
<td class="org-left"><b><b>Agilidade</b></b></td>
<td class="org-left">Mais que uma resposta à mudança, abrange a filosofia do manifesto ágil. Incentiva comunicação fácil em equipe, entrega rápida de software operacional, cliente como parte da equipe e planos flexíveis. Pode ser aplicada a qualquer projeto, sendo essencial que a equipe possa adaptar tarefas, planejar compreendendo a fluidez, eliminar artefatos não essenciais e enfatizar entrega incremental.</td>
</tr>

<tr>
<td class="org-left"><b><b>Princípios do Manifesto Ágil</b></b></td>
<td class="org-left">Doze princípios que definem o espírito ágil, incluindo priorizar satisfação do cliente, aceitar mudanças, entregar software frequentemente, colaborar com cliente, confiar em indivíduos motivados, comunicação face a face, software em funcionamento como medida de progresso, desenvolvimento sustentável, excelência técnica, simplicidade, equipes auto-organizadas e autoavaliação regular.</td>
</tr>

<tr>
<td class="org-left"><b><b>Método XP (Extreme Programming)</b></b></td>
<td class="org-left">Um método ágil que requer seguir uma série de práticas relacionadas ao cliente, gerência, programação e testes.</td>
</tr>

<tr>
<td class="org-left"><b><b>Práticas do Método XP</b></b></td>
<td class="org-left">Incluem: Jogo de planejamento (equipe e cliente priorizam funcionalidades semanalmente); Programação em pares (dois programadores na mesma máquina, um usando a máquina e outro auxiliando); Padrões de codificação (equipe segue padrões para o código parecer ter sido desenvolvido pela mesma pessoa); Testes de aceitação (planejados e conduzidos com o cliente para verificar requisitos); Desenvolvimento orientado a teste (definir e implementar testes antes de programar a unidade); Refatoração (não fugir da refatoração para manter complexidade gerenciável); Integração contínua (integrar funcionalidade assim que viável para evitar surpresas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Método FDD (Feature Driven-Development)</b></b></td>
<td class="org-left">Método ágil que enfatiza orientação a objetos, apresentado em 1997. Dividido em duas fases.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do Método FDD</b></b></td>
<td class="org-left">Incluem: <b><b>Concepção e planejamento</b></b> (pensar antes de construir, em geral de uma a duas semanas); <b><b>Construção</b></b> (desenvolvimento iterativo do produto em ciclos de uma a duas semanas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Disciplinas do Método FDD</b></b></td>
<td class="org-left">Na fase de Concepção e planejamento: Desenvolver Modelo Abrangente (uso de modelagem orientada a objetos); Construir Lista de Funcionalidades (decomposição funcional para identificar funcionalidades); Planejar por Funcionalidade (planejamento de ciclos iterativos baseado em funcionalidades). Na fase de Construção: Detalhar por Funcionalidade (design orientado a objetos); Construir por Funcionalidade (construir e testar software usando linguagem e técnica orientadas a objetos).</td>
</tr>

<tr>
<td class="org-left"><b><b>Método DSDM (Dynamic Systems Development Method)</b></b></td>
<td class="org-left">Modelo ágil baseado em desenvolvimento iterativo e incremental com participação ativa do usuário. Composto por três fases.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do Método DSDM</b></b></td>
<td class="org-left">Incluem: <b><b>Pré-projeto</b></b> (projeto é identificado, negociado, orçamento definido, contrato assinado); <b><b>Ciclo de vida</b></b> (inicia com análise de viabilidade e negócio, depois entra em ciclos iterativos de desenvolvimento); <b><b>Pós-projeto</b></b> (período considerado de manutenção). A fase de Ciclo de Vida se concentra nas atividades de Exploração, Engenharia e Desenvolvimento em ciclos iterativos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Princípios da filosofia DSDM</b></b></td>
<td class="org-left">Incluem: Envolvimento do usuário o tempo todo; Autonomia dos desenvolvedores para tomar decisões; Entregas frequentes de releases suficientemente boas; Eficácia das entregas na solução de problemas de negócio; Feedback dos usuários realimentando o processo; Reversibilidade de todas as ações; Previsibilidade do escopo e objetivos das iterações; Ausência de testes no escopo (considera teste fora do ciclo de vida).</td>
</tr>

<tr>
<td class="org-left"><b><b>Método Crystal Clear</b></b></td>
<td class="org-left">Método ágil criado por Alistair Cockburn em 1997, adequado para equipes pequenas (até 8 pessoas) que trabalham juntas. Propõe o uso de radiadores de informação, acesso fácil a especialistas, eliminação de distrações, cronograma e ajuste do método.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ciclo de vida do Crystal Clear</b></b></td>
<td class="org-left">Organizado em três níveis: Iteração (estimação, desenvolvimento, celebração, dura poucas semanas); Entrega (várias iterações, entrega funcionalidades úteis em no máximo dois meses); Projeto (conjunto de todas as entregas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Pilares do Crystal Clear</b></b></td>
<td class="org-left">Incluem: Entrega frequente de software utilizável; Melhoria reflexiva (equipe reflete regularmente sobre seu processo); Comunicação osmótica (equipe na mesma sala ou contíguas para ouvir conversas relevantes); Segurança pessoal (desenvolvedores podem falar sem medo); Foco (membros da equipe têm tópicos de alta prioridade para trabalhar tranquilamente); Cooperação; Ambiente técnico com integração frequente e testes automatizados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Método ASD (Adaptive Software Development)</b></b></td>
<td class="org-left">Modelo ágil baseado em desenvolvimento cíclico iterativo. Fundamenta-se em três grandes fases.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do Modelo ASD</b></b></td>
<td class="org-left">Incluem: <b><b>Especular</b></b> (início do projeto, planejamento de ciclos adaptáveis, definindo duração, ciclos, objetivos, componentes, tecnologias e tarefas); <b><b>Colaborar</b></b> (foco no desenvolvimento dos componentes especificados); <b><b>Aprender</b></b> (revisão da qualidade, testes e manutenção). As três fases formam um ciclo iterativo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Método Scrum</b></b></td>
<td class="org-left">Modelo ágil para a gestão de projetos de software. Um dos conceitos mais importantes é o Sprint. Segue três fases na execução.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fases do Método Scrum</b></b></td>
<td class="org-left">Incluem: <b><b>Planejamento geral</b></b> (estabelece objetivos gerais do projeto e arquitetura); <b><b>Série de ciclos de Sprint</b></b> (cada ciclo desenvolve um incremento do sistema); <b><b>Encerramento do projeto</b></b> (completa documentação e avalia lições aprendidas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Papéis do Método Scrum</b></b></td>
<td class="org-left">Incluem: <b><b>Scrum Master</b></b> (responsável por manter o time em ambiente propício, facilitador e solucionador de conflitos); <b><b>Product Owner</b></b> (representa a voz do cliente, responsável pelo valor de negócio e necessidades dos clientes, indica requisitos mais importantes por sprint); <b><b>Scrum team</b></b> (responsável pelo desenvolvimento das entregas, entende requisitos, equipe de desenvolvimento geralmente com 6 a 10 pessoas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Product Backlog (Scrum)</b></b></td>
<td class="org-left">Lista das funcionalidades a serem implementadas em cada projeto, como os requisitos. Não precisa ser completo no início do projeto, podendo começar com as funcionalidades mais evidentes.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sprint (Scrum)</b></b></td>
<td class="org-left">Ciclo de desenvolvimento com poucas semanas de duração. No início de cada Sprint, a equipe prioriza elementos do Product Backlog para o Sprint Backlog.</td>
</tr>

<tr>
<td class="org-left"><b><b>Sprint Backlog (Scrum)</b></b></td>
<td class="org-left">Lista de funcionalidades a serem implementadas no ciclo (Sprint) que se inicia. O Product Owner deve mantê-lo atualizado durante o Sprint.</td>
</tr>

<tr>
<td class="org-left"><b><b>Reuniões no Scrum</b></b></td>
<td class="org-left">Incluem: <b><b>Reuniões diárias</b></b> (equipe se reúne diariamente para compartilhar o que fez ontem, o que fará hoje e quais impedimentos enfrenta); <b><b>Reunião de Revisão</b></b> (ao final de cada Sprint, para avaliar o que foi feito e receber feedback do Product Owner e stakeholders); <b><b>Reunião de Retrospectiva</b></b> (ao final de cada Sprint, para a equipe autoavaliar seu desempenho e identificar melhorias).</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
