engenharia-software.html
<div id="outline-container-org07b411c" class="outline-3">
<h3 id="org07b411c">Capítulo 3</h3>
<div class="outline-text-3" id="text-org07b411c">
</div>
<div id="outline-container-orgfd3e432" class="outline-4">
<h4 id="orgfd3e432">Projeto de arquitetura de software, requisitos e gerenciamento de configuração</h4>
<div class="outline-text-4" id="text-orgfd3e432">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Projeto de arquitetura de software</b></b></td>
<td class="org-left">Tarefa de definir a estrutura geral do sistema, partindo do contexto geral para então distribuir os processos e componentes. Representa a estrutura de dados e componentes necessários, considerando o estilo de arquitetura, estrutura e propriedades dos componentes e suas inter-relações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Projeto</b></b></td>
<td class="org-left">Definido como "um esforço temporário empreendido para criar um produto, serviço ou resultado único" (Guia PMBOK) e "um empreendimento planejado, orientado a resultados, possuindo atividades com início e término, para atingir um objetivo claro e definido" (Metodologia SISP).</td>
</tr>

<tr>
<td class="org-left"><b><b>Projeto de software</b></b></td>
<td class="org-left">Um processo em várias etapas onde representações de dados, estrutura do programa, características de interfaces e detalhes procedurais são sintetizados com base nos requisitos. Corresponde a um esquema preliminar pelo qual o software é construído, considerando domínios de dados, funcional e comportamental.</td>
</tr>

<tr>
<td class="org-left"><b><b>Estilo ou padrão de arquitetura</b></b></td>
<td class="org-left">Descrição abstrata, estilizada, de práticas recomendadas testadas e aprovadas em diferentes subsistemas e ambientes. O projeto de arquitetura considera o estilo que o sistema assumirá.</td>
</tr>

<tr>
<td class="org-left"><b><b>Etapas do projeto de arquitetura</b></b></td>
<td class="org-left">Incluem: Definir entidades externas com as quais o software interage; Identificar arquétipos arquiteturais (abstrações de elementos do sistema, similares a classes); Análise de estilos ou padrões de arquitetura alternativos; Implementação da arquitetura utilizando um modelo de processos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Projeto conceitual</b></b></td>
<td class="org-left">Primeira fase do processo iterativo de projeto, apresenta ao cliente o que o sistema fará.</td>
</tr>

<tr>
<td class="org-left"><b><b>Projeto técnico (ou lógico)</b></b></td>
<td class="org-left">Deriva do projeto conceitual após aprovação do cliente, sendo um modelo mais detalhado focado nas definições técnicas para o desenvolvimento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Padrões de arquitetura de software</b></b></td>
<td class="org-left">Diversos padrões que podem ser utilizados no desenvolvimento de sistemas, como arquitetura centralizada em dados, fluxo de dados, orientada a objetos, MVC, entre outros.</td>
</tr>

<tr>
<td class="org-left"><b><b>Arquitetura centralizada em dados</b></b></td>
<td class="org-left">Padrão comum em sistemas de informação, onde um repositório de dados (banco de dados) reside no centro e é acessado por outros componentes para modificar dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Arquitetura de fluxo de dados (Duto e filtro)</b></b></td>
<td class="org-left">Padrão aplicado quando dados de entrada devem ser transformados por uma série de componentes de processamento (filtros), onde cada componente realiza uma transformação de dados discreta.</td>
</tr>

<tr>
<td class="org-left"><b><b>Arquitetura orientada a objetos</b></b></td>
<td class="org-left">Padrão que fornece uma descrição abstrata do software, aproximando as estruturas do programa de conceitos do mundo real. Baseia-se em classes (conjunto de características e comportamentos) e objetos (instâncias de uma classe).</td>
</tr>

<tr>
<td class="org-left"><b><b>Arquitetura Modelo, Visão e Controlador (MVC)</b></b></td>
<td class="org-left">Padrão que foca em separar a apresentação e interação dos dados do sistema. Estruturado em três componentes lógicos: Modelo (gerencia dados e operações); Visão (define e gerencia como dados são apresentados ao usuário); Controlador (gerencia interação do usuário e a passa para Visão e Modelo).</td>
</tr>

<tr>
<td class="org-left"><b><b>Levantamento de requisitos</b></b></td>
<td class="org-left">Primeira etapa na construção de um sistema. Processo no qual engenheiros de software trabalham com clientes e usuários para obter informações sobre o domínio da aplicação, serviços, desempenho, restrições, etc..</td>
</tr>

<tr>
<td class="org-left"><b><b>Requisitos de um sistema</b></b></td>
<td class="org-left">Descrições do que o sistema deve fazer, os serviços que oferece e as restrições a seu funcionamento. Refletem as necessidades dos clientes. Classificados como funcionais e não funcionais.</td>
</tr>

<tr>
<td class="org-left"><b><b>Descoberta de requisitos</b></b></td>
<td class="org-left">Processo de reunir informações sobre o sistema requerido e sistemas existentes, separando requisitos de usuário e sistema de fontes como documentações, usuários e sistemas similares.</td>
</tr>

<tr>
<td class="org-left"><b><b>Técnicas de levantamento de requisitos</b></b></td>
<td class="org-left">Incluem: Entrevistas (formais/informais com usuários e partes interessadas); Cenários (descrições textuais ou diagramáticas de interações); Casos de uso (abordagem estruturada de cenários, identificando atores e tipo de interação); Etnografia (observação para compreender processos operacionais).</td>
</tr>

<tr>
<td class="org-left"><b><b>Especificação de requisitos</b></b></td>
<td class="org-left">Processo de escrever os requisitos de usuário e de sistema em um documento de requisitos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Métodos de especificação de requisitos</b></b></td>
<td class="org-left">Incluem: Sentenças em linguagem natural (requisitos escritos em frases numeradas); Linguagem natural estruturada (requisitos em linguagem natural em formulário/template); Notações gráficas (modelos gráficos, como diagramas UML, suplementados por texto); Especificações matemáticas (baseadas em conceitos matemáticos, podem reduzir ambiguidade mas são menos compreendidas por clientes).</td>
</tr>

<tr>
<td class="org-left"><b><b>Gerenciamento de configuração e mudança</b></b></td>
<td class="org-left">Conjunto de atividades para gerenciar alterações em sistemas de software, identificando artefatos e controlando mudanças.</td>
</tr>

<tr>
<td class="org-left"><b><b>Atividades da gestão de configuração de software</b></b></td>
<td class="org-left">Incluem: Controle de versão (gerenciar diferentes versões de artefatos); Construção de sistema (reunir componentes, dados e bibliotecas para criar executável); Gerenciamento de mudanças (controlar solicitações de mudança, avaliar custo/impacto e decidir implementação); Gerenciamento de lançamentos (preparação de versões do sistema).</td>
</tr>

<tr>
<td class="org-left"><b><b>Controle de versão (Git)</b></b></td>
<td class="org-left">Sistema de controle de versão. Permite criar, gerenciar e trocar entre ramificações (branchs).</td>
</tr>

<tr>
<td class="org-left"><b><b>Ramificação (Git)</b></b></td>
<td class="org-left">Permite criar novas linhas de desenvolvimento separadas. Podem ser associadas à ramificação principal (master).</td>
</tr>

<tr>
<td class="org-left"><b><b>GitHub</b></b></td>
<td class="org-left">Plataforma para hospedagem de projetos gerenciados com Git.</td>
</tr>

<tr>
<td class="org-left"><b><b>Manutenção de software</b></b></td>
<td class="org-left">Processo geral de mudança em um sistema após sua liberação para uso.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de manutenção de software</b></b></td>
<td class="org-left">Incluem: Correção de defeitos; Adaptação ambiental; Adição de funcionalidade. Na prática, as distinções podem ser tênues.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
