engenharia-software.html
<div id="outline-container-orgb60212d" class="outline-3">
<h3 id="orgb60212d">Capítulo 4</h3>
<div class="outline-text-3" id="text-orgb60212d">
</div>
<div id="outline-container-org226d25c" class="outline-4">
<h4 id="org226d25c">Estimativas de esforço e custo para desenvolvimento de softwares</h4>
<div class="outline-text-4" id="text-org226d25c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Estimativas de esforço para desenvolvimento de softwares</b></b></td>
<td class="org-left">Processo para realizar estimativas adequadas de tempo, tamanho da equipe e custo para aplicação de modelos de processos e arquiteturas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Análise de Ponto de Função (APF)</b></b></td>
<td class="org-left">Técnica de medição do tamanho funcional de um software. Mede o que o software faz, não como ele foi construído, baseada nos requisitos lógicos do usuário. Uma medida de tamanho funcional, usada com outras variáveis para derivar produtividade, custo e esforço.</td>
</tr>

<tr>
<td class="org-left"><b><b>Tamanho funcional de um software</b></b></td>
<td class="org-left">O que é medido pela Análise de Ponto de Função.</td>
</tr>

<tr>
<td class="org-left"><b><b>Processo de contagem de pontos de função</b></b></td>
<td class="org-left">Dividido em seis etapas: determinar tipo de contagem; identificar escopo e fronteira; contar funções (dados e transação); determinar pontos não ajustados; determinar fator de ajuste; calcular pontos ajustados (AFP).</td>
</tr>

<tr>
<td class="org-left"><b><b>Tipos de contagem (APF)</b></b></td>
<td class="org-left">Incluem: Projeto de desenvolvimento (novo projeto); Projeto de melhoria (funções adicionadas, modificadas, eliminadas em projeto existente); Aplicação (projeto finalizado).</td>
</tr>

<tr>
<td class="org-left"><b><b>Escopo de contagem (APF)</b></b></td>
<td class="org-left">Determinar se a contagem foca em um ou mais sistemas ou partes deles. Define quais funções serão incluídas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fronteira da aplicação (APF)</b></b></td>
<td class="org-left">Estabelece um divisor entre componentes do aplicativo e de outros aplicativos. É a linha que separa uma aplicação de outra.</td>
</tr>

<tr>
<td class="org-left"><b><b>Funções tipo dados (APF)</b></b></td>
<td class="org-left">Referem-se a funcionalidades para armazenamento de dados da aplicação, caracterizadas como arquivos lógicos (ALI e AIE).</td>
</tr>

<tr>
<td class="org-left"><b><b>ALI (Arquivos Lógicos Internos) (APF)</b></b></td>
<td class="org-left">Arquivos lógicos mantidos dentro da fronteira da aplicação. Ex: arquivos de configuração, tabelas de BD mantidas pela aplicação.</td>
</tr>

<tr>
<td class="org-left"><b><b>AIE (Arquivos de Interface Externa) (APF)</b></b></td>
<td class="org-left">Arquivos lógicos mantidos fora da aplicação ou lidos de outra. Ex: dados de segurança, dados salariais em outra aplicação.</td>
</tr>

<tr>
<td class="org-left"><b><b>RLR (Registros Lógicos Referenciados) (APF)</b></b></td>
<td class="org-left">Subgrupo de DER, reconhecido pelo usuário. Ex: uma tabela do banco de dados.</td>
</tr>

<tr>
<td class="org-left"><b><b>DER (Dados Lógicos Referenciados) (APF)</b></b></td>
<td class="org-left">Campo único, reconhecido pelo usuário, não repetido. Ex: um atributo de uma tabela do banco de dados. Chaves estrangeiras não são contadas como DER.</td>
</tr>

<tr>
<td class="org-left"><b><b>Funções tipo transação (APF)</b></b></td>
<td class="org-left">Representam funcionalidades de processamento de dados do sistema, classificadas em EE, SE e CE. Denominadas processos elementares.</td>
</tr>

<tr>
<td class="org-left"><b><b>Processos elementares (APF)</b></b></td>
<td class="org-left">A menor unidade de uma função disponível ao usuário, única e independente.</td>
</tr>

<tr>
<td class="org-left"><b><b>EE (Entrada Externa) (APF)</b></b></td>
<td class="org-left">Processo elementar que manipula dados ou informações de controle originados fora da fronteira, com intenção de manter (incluir, alterar, excluir) ALI ou alterar comportamento do sistema.</td>
</tr>

<tr>
<td class="org-left"><b><b>SE (Saída Externa) (APF)</b></b></td>
<td class="org-left">Processo elementar que envia dados ou informações de controle para fora, com intenção de apresentar informação ao usuário via lógica de processamento (não apenas recuperação). Ex: Relatórios com totalização, informações gráficas.</td>
</tr>

<tr>
<td class="org-left"><b><b>CE (Consulta Externa) (APF)</b></b></td>
<td class="org-left">Processo elementar que envia dados ou informações de controle para fora, com intenção de apresentar informação via simples recuperação de dados de ALI/AIE. A lógica de processamento não deve conter fórmulas/cálculos. Ex: Informações com formato gráfico.</td>
</tr>

<tr>
<td class="org-left"><b><b>Pontos de função não ajustados (AFP não ajustados)</b></b></td>
<td class="org-left">Total obtido somando-se os pontos das funções tipo dados e funções tipo transação. Representam o tamanho funcional da aplicação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fator de ajuste (APF)</b></b></td>
<td class="org-left">Fator derivado dos itens de influência que afetam o tamanho funcional de um aplicativo. Calculado por: (pontos de influência x 0,01) + 0,65.</td>
</tr>

<tr>
<td class="org-left"><b><b>Itens de influência (APF)</b></b></td>
<td class="org-left">14 características intrínsecas a um aplicativo que afetam seu tamanho funcional, cada uma pontuada de 0 a 5. Ex: Comunicação de dados, Funções distribuídas, Performance, Interface com o usuário, Reusabilidade, Facilidade de mudanças, etc..</td>
</tr>

<tr>
<td class="org-left"><b><b>Pontos de função ajustados (AFP)</b></b></td>
<td class="org-left">Obtidos multiplicando os pontos de função não ajustados pelo fator de ajuste. Processo opcional; os pontos não ajustados podem ser considerados AFP.</td>
</tr>

<tr>
<td class="org-left"><b><b>Duração e custo de um projeto (Estimativa)</b></b></td>
<td class="org-left">Para calcular o custo, é necessário saber o esforço total e o custo por hora/mês de trabalho. O custo é obtido multiplicando o esforço total pelo custo por hora/mês. A duração do projeto em horas por ponto de função varia por linguagem/tecnologia.</td>
</tr>

<tr>
<td class="org-left"><b><b>Esforço (Estimativa)</b></b></td>
<td class="org-left">O esforço total do desenvolvimento é calculado com base no tamanho funcional (AFP) e na produtividade (pontos de função produzidos por hora/mês). Obter histórico de projetos ajuda a estimar com maior precisão.</td>
</tr>

<tr>
<td class="org-left"><b><b>Pontos de Casos de Uso (PCU)</b></b></td>
<td class="org-left">Técnica de estimativa surgida em 1993, considerada mais simples que APF. Baseia-se na análise da quantidade e complexidade de atores e casos de uso, gerando pontos não ajustados (UUCP) e depois ajustados (UCP) pela aplicação de fatores.</td>
</tr>

<tr>
<td class="org-left"><b><b>UUCP (Pontos de caso de uso não ajustados)</b></b></td>
<td class="org-left">Soma dos pontos atribuídos aos casos de uso e do peso não ajustado dos atores.</td>
</tr>

<tr>
<td class="org-left"><b><b>UCP (Pontos de caso de uso ajustados)</b></b></td>
<td class="org-left">Obtidos multiplicando-se o total de UUCP pelo TCF e EF.</td>
</tr>

<tr>
<td class="org-left"><b><b>Complexidade dos atores (PCU)</b></b></td>
<td class="org-left">Definida como simples (pessoa), média (outro sistema), ou complexa (outro sistema com interface gráfica). Cada ator é contado uma única vez.</td>
</tr>

<tr>
<td class="org-left"><b><b>Complexidade dos casos de uso (PCU)</b></b></td>
<td class="org-left">Definida de três formas: por número de transações (simples: até 3, média: 4-7, complexo: acima de 7); por quantidade de classes necessárias (simples: até 5, média: 6-10, complexo: mais de 10); por análise de risco (simples: baixo risco, média: padronizado, complexo: não padronizado, alto risco). Somente casos de uso completos são contados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fatores técnicos (PCU)</b></b></td>
<td class="org-left">Treze fatores que recebem pontuação de 0 a 5, usados na análise de PCU ajustados. Ex: Sistema distribuído, Performance, Segurança, Portabilidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>TCF (Fator de complexidade técnica) (PCU)</b></b></td>
<td class="org-left">Fator calculado com base nos 13 fatores técnicos: 0,6 + (0,01 * total da soma dos pontos de fatores técnicos).</td>
</tr>

<tr>
<td class="org-left"><b><b>Fatores ambientais (PCU)</b></b></td>
<td class="org-left">Oito fatores específicos às características da equipe de desenvolvimento, usados na análise de PCU ajustados. Ex: Familiaridade com o processo, Experiência com a aplicação, Motivação, Equipe em tempo parcial.</td>
</tr>

<tr>
<td class="org-left"><b><b>EF (Fator ambiental total) (PCU)</b></b></td>
<td class="org-left">Fator calculado com base nos 8 fatores ambientais: 1,4 – (0,03 x total da soma dos fatores ambientais).</td>
</tr>

<tr>
<td class="org-left"><b><b>Pontos de Histórias (PH)</b></b></td>
<td class="org-left">Técnica de estimativa variante da APF, preferida em métodos ágeis como Scrum e XP. Medida de esforço relativa à equipe de desenvolvimento, não de complexidade funcional.</td>
</tr>

<tr>
<td class="org-left"><b><b>História de usuário (PH)</b></b></td>
<td class="org-left">Explicação informal e geral sobre um recurso de software, escrita sob a perspectiva do usuário final. A estimativa de pontos de história pode ser feita subjetivamente pela equipe ou atribuindo pontos de acordo com o tempo de desenvolvimento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Ksloc (Miles de Linhas de Código Fonte)</b></b></td>
<td class="org-left">Métrica rudimentar de estimativa baseada na quantidade de linhas de código fonte. Pode ser estimada pela equipe com valores otimista, pessimista e esperado.</td>
</tr>

<tr>
<td class="org-left"><b><b>Modelo COCOMO (Constructive Cost Model)</b></b></td>
<td class="org-left">Principal modelo de estimativa de tamanho de equipe e tempo linear de desenvolvimento. Considera Ksloc e outros fatores para estimar esforço, tempo e pessoas. Possui três modos de implementação (básica, intermediária, avançada) e considera o tipo de projeto (orgânico, semidestacado, embutido).</td>
</tr>

<tr>
<td class="org-left"><b><b>Esforço (E) (COCOMO)</b></b></td>
<td class="org-left">Esforço estimado em desenvolvedor/mês. Calculado com base em Ksloc e constantes (modelo básico) ou Ksloc e fatores influenciadores de custo (modelos intermediário/avançado).</td>
</tr>

<tr>
<td class="org-left"><b><b>Tempo linear de desenvolvimento (T) (COCOMO)</b></b></td>
<td class="org-left">Tempo sugerido em meses corridos. Calculado com base no esforço e constantes.</td>
</tr>

<tr>
<td class="org-left"><b><b>Número médio de pessoas (P) (COCOMO)</b></b></td>
<td class="org-left">Número médio de pessoas recomendado para a equipe. Calculado dividindo o esforço pelo tempo linear de desenvolvimento (E/T).</td>
</tr>

<tr>
<td class="org-left"><b><b>Fatores influenciadores de custo (COCOMO Intermediário/Avançado)</b></b></td>
<td class="org-left">15 fatores que afetam o esforço, relacionados a produto, hardware, pessoal e processo. Cada fator tem pesos que variam de Muito baixo a Muito alto.</td>
</tr>

<tr>
<td class="org-left"><b><b>EAF (Esforço de Ajuste de Fatores) (COCOMO Intermediário/Avançado)</b></b></td>
<td class="org-left">Valor obtido pela multiplicação dos 15 fatores influenciadores de custo. Utilizado no cálculo do esforço.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
