engenharia-software.html
<div id="outline-container-orga6bba67" class="outline-3">
<h3 id="orga6bba67">Capítulo 5</h3>
<div class="outline-text-3" id="text-orga6bba67">
</div>
<div id="outline-container-org0693ecd" class="outline-4">
<h4 id="org0693ecd">Teste de software e suas técnicas</h4>
<div class="outline-text-4" id="text-org0693ecd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Teste de software</b></b></td>
<td class="org-left">Uma das fases mais importantes do desenvolvimento, tem como objetivo compreender seus conceitos para identificar possíveis defeitos e revelar esses defeitos através de casos de teste adequados. É o processo de executar um programa com a intenção de revelar defeitos, não provar a ausência deles.</td>
</tr>

<tr>
<td class="org-left"><b><b>Técnicas de teste de software</b></b></td>
<td class="org-left">Três técnicas propostas na literatura: funcional, estrutural e baseada em defeitos. Distinguem-se pela fonte utilizada para definir os requisitos de teste.</td>
</tr>

<tr>
<td class="org-left"><b><b>Critérios de teste</b></b></td>
<td class="org-left">Propostas dentro das técnicas de teste que visam atingir o objetivo de revelar defeitos. Cada critério procura explorar determinados tipos de defeitos, estabelecendo requisitos de teste.</td>
</tr>

<tr>
<td class="org-left"><b><b>Engano (Conceito de teste)</b></b></td>
<td class="org-left">Caracteriza-se como uma ação equivocada de um conceito específico do domínio, geralmente causado por humanos. Pode ser, por exemplo, um erro de digitação ou lógica ao escrever o código.</td>
</tr>

<tr>
<td class="org-left"><b><b>Defeito (Conceito de teste)</b></b></td>
<td class="org-left">A existência de um defeito em um programa leva à ocorrência de um erro, desde que o defeito seja executado. Por exemplo, uma condição lógica incorreta que causa um comportamento inesperado.</td>
</tr>

<tr>
<td class="org-left"><b><b>Erro (Conceito de teste)</b></b></td>
<td class="org-left">Caracteriza-se por um estado inconsistente ou inesperado devido à execução de um defeito.</td>
</tr>

<tr>
<td class="org-left"><b><b>Falha (Conceito de teste)</b></b></td>
<td class="org-left">Pode ser ocasionada por um estado inconsistente ou inesperado (erro).</td>
</tr>

<tr>
<td class="org-left"><b><b>Dados de teste</b></b></td>
<td class="org-left">É um elemento do domínio de entrada de um programa. Ex: Para um programa que computa x<sup>y</sup> com x, y &gt; 1, (2, 5) é um dado de teste.</td>
</tr>

<tr>
<td class="org-left"><b><b>Casos de teste</b></b></td>
<td class="org-left">É um par formado por um dado de teste mais o resultado esperado para a execução do programa com aquele dado de teste. Ex: Para o dado de teste (2, 5), o caso de teste é ((2, 5), 10).</td>
</tr>

<tr>
<td class="org-left"><b><b>Domínio de entrada</b></b></td>
<td class="org-left">O conjunto de todos os possíveis valores que podem ser utilizados para executar um programa. Ex: Para um programa que computa x<sup>y</sup> para x, y &gt; 1, o domínio de entrada são todos os pares (x, y) de inteiros maiores que 1.</td>
</tr>

<tr>
<td class="org-left"><b><b>Domínio de saída</b></b></td>
<td class="org-left">O conjunto de todos os possíveis resultados produzidos por um programa.</td>
</tr>

<tr>
<td class="org-left"><b><b>Oráculo de teste</b></b></td>
<td class="org-left">Necessário para saber o resultado esperado para a execução de um dado de teste. Permite comparar os resultados obtidos com os esperados para verificar a correção do programa.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste de seleção</b></b></td>
<td class="org-left">Procura identificar quais dados de teste devem ser selecionados do domínio de entrada.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste de partição</b></b></td>
<td class="org-left">Procura estabelecer subconjuntos de dados de teste e selecionar casos de teste em cada subconjunto. Dados que satisfazem o mesmo requisito de teste (ex: executar determinada estrutura) pertencem ao mesmo subconjunto.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste de Funcionalidade (Caixa preta)</b></b></td>
<td class="org-left">Método de teste que verifica e valida se as funções implementadas no software estão corretas em seus diversos níveis. Executado sobre as entradas e saídas do programa sem conhecimento do código-fonte. Inclui testes de unidade, integração, sistema e aceitação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Testes de unidade</b></b></td>
<td class="org-left">Os testes mais básicos, consistem em verificar se um componente individual do software funciona corretamente.</td>
</tr>

<tr>
<td class="org-left"><b><b>Testes de integração</b></b></td>
<td class="org-left">Feitos quando unidades prontas e testadas isoladamente precisam ser integradas para gerar uma nova versão do sistema.</td>
</tr>

<tr>
<td class="org-left"><b><b>Estratégias de integração</b></b></td>
<td class="org-left">Incluem: Big-bang (constrói e testa todas as classes/unidades juntas); Top-down (integração e teste de cima para baixo na hierarquia do sistema); Bottom-up (integração e teste de baixo para cima).</td>
</tr>

<tr>
<td class="org-left"><b><b>Testes de sistema</b></b></td>
<td class="org-left">Testes feitos quando o sistema está completo e integrado. Focam em verificar se os requisitos funcionais e não funcionais foram atendidos. A execução do fluxo principal e fluxos alternativos do caso de uso é verificada.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste de Aceitação</b></b></td>
<td class="org-left">Similar aos testes de sistema, com o foco principal em verificar se os requisitos foram atendidos conforme a especificação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste Estrutural (Caixa branca)</b></b></td>
<td class="org-left">Técnica em que todos os testes são executados com conhecimento do código-fonte. Capaz de detectar quantidade substancial de erros garantindo a execução de comandos e condições. Inclui critérios baseados na complexidade e fluxo de controle.</td>
</tr>

<tr>
<td class="org-left"><b><b>Critérios baseados na complexidade (Teste Estrutural)</b></b></td>
<td class="org-left">Utilizam informações sobre a complexidade do programa para derivar requisitos de software. Ex: complexidade ciclomática e caminhos linearmente independentes.</td>
</tr>

<tr>
<td class="org-left"><b><b>Complexidade ciclomática</b></b></td>
<td class="org-left">Métrica de software que proporciona uma medida quantitativa da complexidade lógica de um programa. Para n estruturas de seleção/repetição, a complexidade é n+1. Indica o número máximo de caminhos necessários para exercitar todos os comandos. Programas com complexidade &lt;= 10 são simples.</td>
</tr>

<tr>
<td class="org-left"><b><b>Caminhos linearmente independentes</b></b></td>
<td class="org-left">Qualquer caminho do programa que introduza pelo menos um novo conjunto de instruções ou uma nova condição. Determinados a partir do grafo de fluxo de controle (GFC).</td>
</tr>

<tr>
<td class="org-left"><b><b>Grafo de fluxo de controle (GFC)</b></b></td>
<td class="org-left">Representação de um programa colocando comandos em nós e fluxos de controle em arestas. Nodos em sequência podem ser um nó; estruturas de seleção/repetição são nós distintos com arestas de decisão/repetição.</td>
</tr>

<tr>
<td class="org-left"><b><b>Critérios baseados no fluxo de controle (Teste Estrutural)</b></b></td>
<td class="org-left">Utilizam o GFC para determinar quais estruturas são necessárias. Ex: Todos-Nós, Todas-Arestas, Todos-Caminhos.</td>
</tr>

<tr>
<td class="org-left"><b><b>Todos-Nós (Critério de teste estrutural)</b></b></td>
<td class="org-left">Exige que a execução do programa passe ao menos uma vez em cada vértice do GFC, ou seja, que cada comando seja executado pelo menos uma vez.</td>
</tr>

<tr>
<td class="org-left"><b><b>Todas-Arestas (Critério de teste estrutural)</b></b></td>
<td class="org-left">Requer que cada aresta do GFC (cada desvio de fluxo) seja exercitada pelo menos uma vez.</td>
</tr>

<tr>
<td class="org-left"><b><b>Todos-Caminhos (Critério de teste estrutural)</b></b></td>
<td class="org-left">Requer que todos os caminhos possíveis do programa sejam executados.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste Funcional (Caixa preta)</b></b></td>
<td class="org-left">Executado sobre as entradas e saídas do programa sem conhecimento do código-fonte. Pode detectar todos os defeitos submetendo o programa a todas as entradas possíveis (teste exaustivo). Inclui critérios como particionamento em classes de equivalência, análise do valor-limite e error-guessing.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste exaustivo</b></b></td>
<td class="org-left">Submeter um programa a todas as possíveis entradas. Geralmente impraticável devido à cardinalidade do domínio de entrada.</td>
</tr>

<tr>
<td class="org-left"><b><b>Particionamento em classes de equivalência (Teste Funcional)</b></b></td>
<td class="org-left">Técnica que divide o domínio de entrada de um programa em conjuntos disjuntos (classes de equivalência), com a suposição de que testar um elemento de um conjunto equivale a testar todos. Requer testar pelo menos um elemento de cada conjunto.</td>
</tr>

<tr>
<td class="org-left"><b><b>Análise do valor-limite (Teste Funcional)</b></b></td>
<td class="org-left">Consiste em considerar valores fronteiriços com outras classes de equivalência para teste, não apenas um valor qualquer dentro de uma classe. Existem diretrizes para definir esses valores (ex: limites de intervalo, valores imediatamente subsequentes, quantidade de valores).</td>
</tr>

<tr>
<td class="org-left"><b><b>Error-guessing (Teste Funcional)</b></b></td>
<td class="org-left">Critério de teste funcional baseado na intuição sobre onde os defeitos provavelmente ocorrem.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste baseado em defeitos</b></b></td>
<td class="org-left">Técnica em que a fonte para definir os requisitos de teste é uma lista de defeitos conhecidos e suas causas. Inclui a análise de mutantes.</td>
</tr>

<tr>
<td class="org-left"><b><b>Análise de mutantes (Teste baseado em defeitos)</b></b></td>
<td class="org-left">Critério que consiste em simular defeitos conhecidos no código-fonte, criando programas mutantes, e confrontá-los com o código original para revelar defeitos e avaliar a qualidade dos casos de teste.</td>
</tr>

<tr>
<td class="org-left"><b><b>Programa mutante (Análise de mutantes)</b></b></td>
<td class="org-left">Um novo programa produzido pela aplicação de um operador de mutação no programa original.</td>
</tr>

<tr>
<td class="org-left"><b><b>Operadores de mutação (Análise de mutantes)</b></b></td>
<td class="org-left">Regras ou padrões que simulam a forma como os programadores cometem erros. A escolha depende da linguagem de programação e dos tipos de defeitos a serem revelados. Ex: Eliminação de comandos, troca de operador relacional, troca de variáveis.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
