engenharia-software.org
** Capítulo 6

*** Fundamentos e recursos da cultura DevOps

| Conceito | Descrição |
|---|---|
| **Cultura de desenvolvimento e operações (DevOps)** | Refere-se à junção dos conceitos de desenvolvimento (Dev) e operações (Ops). É uma cultura que faz uso dos conceitos da engenharia de software (processos, testes, projeto, arquitetura, métodos ágeis) de forma colaborativa. Não é uma tecnologia específica, ferramenta ou automatização de processo. Abrange todo o ciclo de vida do desenvolvimento de software. |
| **Desenvolvimento (Dev) (DevOps)** | Uma das partes que compõem o termo DevOps. Refere-se à equipe de desenvolvimento. |
| **Operações (Ops) (DevOps)** | Uma das partes que compõem o termo DevOps. Refere-se à equipe de operações. |
| **Integração Contínua** | Prática na qual o código é compilado para cada mudança e executa testes automatizados minimamente confiáveis. Contrária aos métodos tradicionais que adiam a integração. O time integra o código pelo menos uma vez por dia em um único tronco. A segmentação de implementação é iniciada automaticamente a cada mudança. |
| **Princípios da Integração Contínua (Fowler)** | Onze princípios que visam tornar a integração contínua mais efetiva, como manter repositório único, automatizar versão, fazer autoteste, commit diário, centralizar commit, corrigir quebra de código imediatamente, manter construção rápida, testar em ambiente próximo à produção, obter executável mais recente, possibilitar visibilidade, automatizar implantação. |
| **Arquitetura de referência DevOps** | Apresenta a perspectiva dos principais recursos que o DevOps pretende fornecer. |
| **Caminhos de adoção do DevOps** | Quatro caminhos propostos: Conduzir (estabelecer objetivos de negócio e ajustar com feedback, inclui planejamento contínuo); Desenvolver/testar (duas práticas: desenvolvimento colaborativo e teste contínuo); Entregar (duas práticas: entrega contínua e implantação contínua); Operar (duas práticas: monitoramento contínuo e feedback contínuo). |
| **Planejamento contínuo do negócio (DevOps - Conduzir)** | Prática incluída no caminho Conduzir. |
| **Desenvolvimento colaborativo (DevOps - Desenvolver/testar)** | Permite que profissionais trabalhem juntos, fornecendo práticas e plataforma comuns; sua atividade central é a integração contínua. |
| **Teste contínuo (DevOps - Desenvolver/testar)** | Significa testar mais cedo e continuamente ao longo do ciclo. |
| **Entrega contínua (DevOps - Entregar)** | Prática incluída no caminho Entregar. |
| **Implantação contínua (DevOps - Entregar)** | Prática incluída no caminho Entregar. |
| **Monitoramento contínuo (DevOps - Operar)** | Prática incluída no caminho Operar. |
| **Feedback contínuo (DevOps - Operar)** | Prática incluída no caminho Operar. |
| **Fontes de ineficiências na entrega de software** | Categorias de ineficiências que o DevOps busca mitigar: supercarga desnecessária (comunicar várias vezes a mesma informação); retrabalho desnecessário (defeitos descobertos tardiamente); superprodução (funcionalidades desenvolvidas não requeridas). |
| **Construir uma cultura DevOps** | Requer que líderes trabalhem com equipes para criar ambiente de colaboração e compartilhamento, removendo barreiras à cooperação. Medições típicas que colocam Dev e Ops uns contra os outros devem ser substituídas por responsabilidade compartilhada. Práticas ágeis como Scrum estão no centro do DevOps. |
| **Princípios básicos para implementar a cultura DevOps** | Incluem: foco no que se deseja melhorar; estabelecer métricas para medir desempenho (somente é possível melhorar o que se pode medir); padronizar tarefas. |
| **Planejamento de liberação (DevOps)** | Função impulsionada pelas necessidades comerciais de oferecer recursos mais rápido; aproveita práticas ágeis para planejar prazos com mais frequência e focar na qualidade. |
| **Mitos sobre DevOps** | Crenças comuns e incorretas sobre o DevOps, como a de que é apenas para desenvolvedores e administradores de sistemas (quando na verdade abrange todas as funções da organização). |

** Observações...

*** Como organizei o conteúdo desta página

Esta página contém resumos dos principais conceitos da disciplina sistema gerenciador de banco de dados, extraídos de arquivos no formato PDF com a ferramenta [[https://notebooklm.google.com][NotebookLM]].

De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:

*Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.*

A partir do segundo pedido, usei o comando:

*Repita o processo anterior para este texto.*

No terceiro pedido, recebi a mensage de:

*O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.*

Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:

*Refaça a tabela para uma melhor formatação em Markdown.*

A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.

* [[./index.html][Voltar para o início...]]
