engenharia-software.html
<div id="outline-container-org93d4fd4" class="outline-3">
<h3 id="org93d4fd4">Capítulo 6</h3>
<div class="outline-text-3" id="text-org93d4fd4">
</div>
<div id="outline-container-org1177a03" class="outline-4">
<h4 id="org1177a03">Fundamentos e recursos da cultura DevOps</h4>
<div class="outline-text-4" id="text-org1177a03">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceito</th>
<th scope="col" class="org-left">Descrição</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Cultura de desenvolvimento e operações (DevOps)</b></b></td>
<td class="org-left">Refere-se à junção dos conceitos de desenvolvimento (Dev) e operações (Ops). É uma cultura que faz uso dos conceitos da engenharia de software (processos, testes, projeto, arquitetura, métodos ágeis) de forma colaborativa. Não é uma tecnologia específica, ferramenta ou automatização de processo. Abrange todo o ciclo de vida do desenvolvimento de software.</td>
</tr>

<tr>
<td class="org-left"><b><b>Desenvolvimento (Dev) (DevOps)</b></b></td>
<td class="org-left">Uma das partes que compõem o termo DevOps. Refere-se à equipe de desenvolvimento.</td>
</tr>

<tr>
<td class="org-left"><b><b>Operações (Ops) (DevOps)</b></b></td>
<td class="org-left">Uma das partes que compõem o termo DevOps. Refere-se à equipe de operações.</td>
</tr>

<tr>
<td class="org-left"><b><b>Integração Contínua</b></b></td>
<td class="org-left">Prática na qual o código é compilado para cada mudança e executa testes automatizados minimamente confiáveis. Contrária aos métodos tradicionais que adiam a integração. O time integra o código pelo menos uma vez por dia em um único tronco. A segmentação de implementação é iniciada automaticamente a cada mudança.</td>
</tr>

<tr>
<td class="org-left"><b><b>Princípios da Integração Contínua (Fowler)</b></b></td>
<td class="org-left">Onze princípios que visam tornar a integração contínua mais efetiva, como manter repositório único, automatizar versão, fazer autoteste, commit diário, centralizar commit, corrigir quebra de código imediatamente, manter construção rápida, testar em ambiente próximo à produção, obter executável mais recente, possibilitar visibilidade, automatizar implantação.</td>
</tr>

<tr>
<td class="org-left"><b><b>Arquitetura de referência DevOps</b></b></td>
<td class="org-left">Apresenta a perspectiva dos principais recursos que o DevOps pretende fornecer.</td>
</tr>

<tr>
<td class="org-left"><b><b>Caminhos de adoção do DevOps</b></b></td>
<td class="org-left">Quatro caminhos propostos: Conduzir (estabelecer objetivos de negócio e ajustar com feedback, inclui planejamento contínuo); Desenvolver/testar (duas práticas: desenvolvimento colaborativo e teste contínuo); Entregar (duas práticas: entrega contínua e implantação contínua); Operar (duas práticas: monitoramento contínuo e feedback contínuo).</td>
</tr>

<tr>
<td class="org-left"><b><b>Planejamento contínuo do negócio (DevOps - Conduzir)</b></b></td>
<td class="org-left">Prática incluída no caminho Conduzir.</td>
</tr>

<tr>
<td class="org-left"><b><b>Desenvolvimento colaborativo (DevOps - Desenvolver/testar)</b></b></td>
<td class="org-left">Permite que profissionais trabalhem juntos, fornecendo práticas e plataforma comuns; sua atividade central é a integração contínua.</td>
</tr>

<tr>
<td class="org-left"><b><b>Teste contínuo (DevOps - Desenvolver/testar)</b></b></td>
<td class="org-left">Significa testar mais cedo e continuamente ao longo do ciclo.</td>
</tr>

<tr>
<td class="org-left"><b><b>Entrega contínua (DevOps - Entregar)</b></b></td>
<td class="org-left">Prática incluída no caminho Entregar.</td>
</tr>

<tr>
<td class="org-left"><b><b>Implantação contínua (DevOps - Entregar)</b></b></td>
<td class="org-left">Prática incluída no caminho Entregar.</td>
</tr>

<tr>
<td class="org-left"><b><b>Monitoramento contínuo (DevOps - Operar)</b></b></td>
<td class="org-left">Prática incluída no caminho Operar.</td>
</tr>

<tr>
<td class="org-left"><b><b>Feedback contínuo (DevOps - Operar)</b></b></td>
<td class="org-left">Prática incluída no caminho Operar.</td>
</tr>

<tr>
<td class="org-left"><b><b>Fontes de ineficiências na entrega de software</b></b></td>
<td class="org-left">Categorias de ineficiências que o DevOps busca mitigar: supercarga desnecessária (comunicar várias vezes a mesma informação); retrabalho desnecessário (defeitos descobertos tardiamente); superprodução (funcionalidades desenvolvidas não requeridas).</td>
</tr>

<tr>
<td class="org-left"><b><b>Construir uma cultura DevOps</b></b></td>
<td class="org-left">Requer que líderes trabalhem com equipes para criar ambiente de colaboração e compartilhamento, removendo barreiras à cooperação. Medições típicas que colocam Dev e Ops uns contra os outros devem ser substituídas por responsabilidade compartilhada. Práticas ágeis como Scrum estão no centro do DevOps.</td>
</tr>

<tr>
<td class="org-left"><b><b>Princípios básicos para implementar a cultura DevOps</b></b></td>
<td class="org-left">Incluem: foco no que se deseja melhorar; estabelecer métricas para medir desempenho (somente é possível melhorar o que se pode medir); padronizar tarefas.</td>
</tr>

<tr>
<td class="org-left"><b><b>Planejamento de liberação (DevOps)</b></b></td>
<td class="org-left">Função impulsionada pelas necessidades comerciais de oferecer recursos mais rápido; aproveita práticas ágeis para planejar prazos com mais frequência e focar na qualidade.</td>
</tr>

<tr>
<td class="org-left"><b><b>Mitos sobre DevOps</b></b></td>
<td class="org-left">Crenças comuns e incorretas sobre o DevOps, como a de que é apenas para desenvolvedores e administradores de sistemas (quando na verdade abrange todas as funções da organização).</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org55146f8" class="outline-3">
<h3 id="org55146f8">Observações&#x2026;</h3>
<div class="outline-text-3" id="text-org55146f8">
</div>
<div id="outline-container-orgf703c25" class="outline-4">
<h4 id="orgf703c25">Como organizei o conteúdo desta página</h4>
<div class="outline-text-4" id="text-orgf703c25">
<p>
Esta página contém resumos dos principais conceitos da disciplina sistema gerenciador de banco de dados, extraídos de arquivos no formato PDF com a ferramenta <a href="https://notebooklm.google.com">NotebookLM</a>.
</p>

<p>
De forma simples, enviei os arquivos para o NotebookLM e pedi os resumos com os seguintes comandos:
</p>

<p>
<b>Organize uma tabela com os principais conceitos do texto. Na primeira coluna, o nome do conceito e na segunda, o conceito em si.</b>
</p>

<p>
A partir do segundo pedido, usei o comando:
</p>

<p>
<b>Repita o processo anterior para este texto.</b>
</p>

<p>
No terceiro pedido, recebi a mensage de:
</p>

<p>
<b>O comando fornecido solicita que o processo anterior seja repetido. No entanto, não há processo anterior no histórico de conversas fornecido. [Me] Para obter uma resposta abrangente, forneça o processo anterior que você gostaria que fosse repetido.</b>
</p>

<p>
Desta forma, alternei entre o primeiro e segundo comando até o último arquivo, que veio com a formatação Markdown deformada. Então, pedi uma última revisão com o comando:
</p>

<p>
<b>Refaça a tabela para uma melhor formatação em Markdown.</b>
</p>

<p>
A publicação final continua uma exportação simples, do formato org mode para HTML, usando o Emacs.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb80a374" class="outline-2">
<h2 id="orgb80a374"><a href="./index.html">Voltar para o início&#x2026;</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Jackson de Jesus</p>
<p class="date">Criado em: 14-05-2025, qua 20:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
